app/controllers/islands_controller.rb

  def index
    @islands = Island.all
---
SELECT `islands`.* FROM `islands`

  def create
    @island = Island.new(island_params)
    if @island.save
---
INSERT INTO `islands` (`name`, `created_at`, `updated_at`) VALUES ('Pulau Jawa', '2016-08-23 09:03:54', '2016-08-23 09:03:54')

    def set_island
      @island = Island.find(params[:id])
---
SELECT  `islands`.* FROM `islands` WHERE `islands`.`id` = 2 LIMIT 1